{
    "respostas": [
        {
            "id": "1",
            "pergunta": "Com que frequência você se sente nervoso(a) ou ansioso(a) antes de provas ou apresentações?",
            "resposta": "Não me sinto ansioso",
            "score": 0
        },
        {
            "id": "2",
            "pergunta": "Você já se sentiu tão sobrecarregado(a) com as responsabilidades acadêmicas que teve dificuldades em dormir?",
            "resposta": "Pouco ansioso",
            "score": 1
        },
        {
            "id": "3",
            "pergunta": "Você costuma sentir que a pressão de ter que dar o seu melhor nas provas e trabalhos está afetando seu bem-estar emocional?",
            "resposta": "Ansiedade enorme",
            "score": 3
        },
        {
            "id": "4",
            "pergunta": "Você sente que se preocupa excessivamente com sua performance acadêmica, mesmo quando não há razão concreta para isso?",
            "resposta": "Muito ansioso",
            "score": 2
        },
        {
            "id": "5",
            "pergunta": "Com que frequência você sente sintomas físicos de ansiedade, como aumento da frequência cardíaca, respiração acelerada ou tremores?",
            "resposta": "Pouco ansioso",
            "score": 1
        },
        {
            "id": "6",
            "pergunta": "Você já sentiu dores de cabeça ou problemas gástricos (ex: dor de estômago, náusea) devido ao estresse acadêmico?",
            "resposta": "Ansiedade enorme",
            "score": 3
        },
        {
            "id": "7",
            "pergunta": "Você tem dificuldades em se concentrar em tarefas acadêmicas devido a pensamentos ansiosos?",
            "resposta": "Ansiedade enorme",
            "score": 3
        },
        {
            "id": "8",
            "pergunta": "Você evita certos compromissos acadêmicos, como apresentações ou discussões em grupo, por medo de não se sair bem?",
            "resposta": "Ansiedade enorme",
            "score": 3
        },
        {
            "id": "9",
            "pergunta": "Quando você está enfrentando um prazo ou uma carga de trabalho pesada, você sente dificuldade em se organizar ou planejar suas atividades?",
            "resposta": "Pouco ansioso",
            "score": 1
        },
        {
            "id": "10",
            "pergunta": "A ansiedade tem afetado sua vida social ou suas interações com amigos e colegas?",
            "resposta": "Não me sinto ansioso",
            "score": 0
        },
        {
            "id": "11",
            "pergunta": "Você já se sentiu tão ansioso(a) em relação aos estudos que isso afetou sua motivação para estudar ou fazer tarefas acadêmicas?",
            "resposta": "Não me sinto ansioso",
            "score": 0
        },
        {
            "id": "12",
            "pergunta": "Você já procurou ajuda (psicológica ou de colegas) para lidar com a ansiedade acadêmica?",
            "resposta": "Muito ansioso",
            "score": 2
        },
        {
            "id": "13",
            "pergunta": "Você utiliza técnicas de relaxamento ou meditação para reduzir a ansiedade relacionada aos estudos?",
            "resposta": "Muito ansioso",
            "score": 2
        }
    ],
    "pontuacoes": {
        "Ansiedade": 21
    },
    "qid": 1,
    "classe": "Ciências da Computação - 1º Período",
    "salvar": "Development"
}